11/data/attachments/b2bb9237e6e39eab.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_d9d3eed9-e509-469f-aa10-3f2a6f815ba9</nif:username>
            <nif:friendToBeAdded>Leonard_finally_Friend_16035_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>